/*Подвиг 4. В программе ниже объявите функцию с именем pow_n, которая принимает два целочисленных значения n, m (m >= 0) и вычисляет n^m. Напомню, что любое число в степени 0 равно 1. Вычисленное значение возвращается функцией. Вызовите в функции main функцию pow_n с аргументами 2 и 4. Выведите результат в консоль в виде целого числа.*/
#include <stdio.h>

int pow_n(int n, int m){
    int result = 1;
    if (m==0)
        return 1;
    else if (m>0){
        for (int i=1; i <= m; i++){
            result *= n;
        }
        return result;
    }
    return -1;
}

int main(void)
{
    // здесь продолжайте функцию main
    printf("%d", pow_n(2,4));
    return 0;
}

